#+TITLE: Chapter 1 Exercises

** Solution
#+begin_src scheme :results value
(/
 (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
 (* 3 (- 6 2) (- 2 7)))
#+end_src

#+RESULTS:
: -37/150

** Solution
#+begin_src scheme
(load-from-path "1_22-definitions.scm")
(define (search-for-primes start)
  (define (search-for-primes-iter n count)
    (if (> count 0)
        (search-for-primes-iter
         (+ n 2)
         (if (timed-prime-test n) (- count 1) count))))
  (search-for-primes-iter
   (if (divides? 2 start) (+ start 1) start)
   3))
#+end_src

#+begin_example
> (search-for-primes 100000)
100003 | 71004
100019 | 69836
100043 | 69686

> (search-for-primes 1000000)
1000003 | 413345
1000033 | 417740
1000037 | 417630

> (search-for-primes 10000000)
10000019 | 692164
10000079 | 673696
10000103 | 697857

> (search-for-primes 100000000)
100000007 | 1731865
100000037 | 1448142
100000039 | 1630682
#+end_example

Let m be the mean time for the three smallest primes greater than 100000 and T_n to be the measured time (in nanoseconds) to check for primality of n. If m is taken take as the standard computation time for prime test, the deviation, D_n, from the expected computation time is:

\[
D_n = T_n - m\left(\frac{\sqrt{n}}{\sqrt{100000}}\right)
\]

Observed mean:
m = 70175

|         n | T_n (ns) |           D_n |
|-----------+----------+---------------|
|   1000003 |   413345 |     191431.83 |
|   1000033 |   417740 |     195823.50 |
|   1000037 |   417630 |     195713.06 |
|  10000019 |   692164 |    -9586.6667 |
|  10000079 |   673696 |    -28056.772 |
|  10000103 |   697857 |    -3896.6140 |
| 100000007 |  1731865 |    -487263.43 |
| 100000037 |  1448142 |    -770986.76 |
| 100000039 |  1630682 |    -588446.78 |
|-----------+----------+---------------|
|  Variance |       -- | 137875470000. |
#+tblfm: $3=$2-70175*(sqrt($1)/sqrt(100000))::@11$3=vvar(@I..@II)

** Solution
#+begin_src scheme :eval query
(load-from-path "1_23-definitions.scm")
(search-for-primes 100000)
(search-for-primes 1000000)
(search-for-primes 10000000)
(search-for-primes 100000000)
#+end_src

#+RESULTS:
#+begin_example
100003 | 28128
100019 | 10090
100043 | 10186
1000003 | 29715
1000033 | 29531
1000037 | 29554
10000019 | 91376
10000079 | 91356
10000103 | 91318
100000007 | 289935
100000037 | 289866
100000039 | 301755
#+end_example


|         n | T_n (ns) | T2_n (ns) |   T_n/T2_n |
|-----------+----------+-----------+------------|
|    100003 |    71004 |     28128 |  1.7497720 |
|    100019 |    69836 |     10090 |  1.7098227 |
|    100043 |    69686 |     10186 |  1.8632122 |
|   1000003 |   413345 |     29715 |  3.6276472 |
|   1000033 |   417740 |     29531 |  3.7525377 |
|   1000037 |   417630 |     29554 |  3.7956357 |
|  10000019 |   692164 |     91376 |  1.1983781 |
|  10000079 |   673696 |     91356 |  1.1906816 |
|  10000103 |   697857 |     91318 |  1.1779986 |
| 100000007 |  1731865 |    289935 |  1.5999182 |
| 100000037 |  1448142 |    289866 | 0.68569829 |
| 100000039 |  1630682 |    301755 | 0.74455436 |
#+TBLFM: $4=$2/$3

** Solution
#+begin_src scheme :eval query
(load-from-path "1_24-definitions.scm")
(timed-prime-test 100003)
(timed-prime-test 100019)
(timed-prime-test 100043)
(timed-prime-test 1000003)
(timed-prime-test 1000033)
(timed-prime-test 1000037)
(timed-prime-test 10000019)
(timed-prime-test 10000079)
(timed-prime-test 10000103)
(timed-prime-test 100000007)
(timed-prime-test 100000037)
(timed-prime-test 100000039)
#+end_src

#+RESULTS:
#+begin_example
100003 | 14723
100019 | 28481
100043 | 6019
1000003 | 4187
1000033 | 4104
1000037 | 4228
10000019 | 6296
10000079 | 5024
10000103 | 4929
100000007 | 5661
100000037 | 5435
100000039 | 7817
#+end_example

\[
D_n = \frac{T3_n}{T2_n} - \frac{\log{n}}{\sqrt{n}}
\]

|         n | T2_n (ns) | T3_n (ns) |         D_n |
|-----------+-----------+-----------+-------------|
|    100003 |     28128 |      1472 | 0.015925580 |
|    100019 |     10090 |      2848 |  0.24585545 |
|    100043 |     10186 |      6019 |  0.55450849 |
|   1000003 |     29715 |      4187 |  0.12708977 |
|   1000033 |     29531 |      4104 |  0.12515729 |
|   1000037 |     29554 |      4228 |  0.12924487 |
|  10000019 |     91376 |      6296 | 0.063805134 |
|  10000079 |     91356 |      5024 | 0.049896679 |
|  10000103 |     91318 |      4929 | 0.048879249 |
| 100000007 |    289935 |      5661 | 0.017682998 |
| 100000037 |    289866 |      5435 | 0.016907975 |
| 100000039 |    301755 |      7817 | 0.024063054 |
#+tblfm: $4=$3/$2 - log($1)/sqrt($1)

** Solution
#+begin_src scheme
(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (< (abs (- v1 v2))
       tolerance))
  (define (try guess n)
    (display "try #")
    (display n)
    (display ": ")
    (display guess)
    (newline)
    (let ((next (f guess)))
      (if (close-enough? guess next)
          next
          (try next (inc n)))))
  (try first-guess 1))

(define (average x y) (/ (+ x y) 2))

(display "Without average damping")
(newline)
(display (fixed-point
          (lambda (x)
            (/ (log 1000) (log x)))
          10.0))
(newline)

(newline)
(display "With average damping")
(newline)
(display (fixed-point
          (lambda (x)
            (average x (/ (log 1000) (log x))))
          10.0))
(newline)
#+end_src

#+RESULTS:
#+begin_example
Without average damping
try #1: 10.0
try #2: 2.9999999999999996
try #3: 6.2877098228681545
try #4: 3.7570797902002955
try #5: 5.218748919675316
try #6: 4.1807977460633134
try #7: 4.828902657081293
try #8: 4.386936895811029
try #9: 4.671722808746095
try #10: 4.481109436117821
try #11: 4.605567315585735
try #12: 4.522955348093164
try #13: 4.577201597629606
try #14: 4.541325786357399
try #15: 4.564940905198754
try #16: 4.549347961475409
try #17: 4.5596228442307565
try #18: 4.552843114094703
try #19: 4.55731263660315
try #20: 4.554364381825887
try #21: 4.556308401465587
try #22: 4.555026226620339
try #23: 4.55587174038325
try #24: 4.555314115211184
try #25: 4.555681847896976
try #26: 4.555439330395129
try #27: 4.555599264136406
try #28: 4.555493789937456
try #29: 4.555563347820309
try #30: 4.555517475527901
try #31: 4.555547727376273
try #32: 4.555527776815261
try #33: 4.555540933824255
4.555532257016376

With average damping
try #1: 10.0
try #2: 6.5
try #3: 5.095215099176933
try #4: 4.668760681281611
try #5: 4.57585730576714
try #6: 4.559030116711325
try #7: 4.55613168520593
try #8: 4.555637206157649
try #9: 4.55555298754564
try #10: 4.555538647701617
4.555536206185039
#+end_example

*** Recursive
#+begin_src scheme
(define (cont-frac n d k)
  (define (recurse i)
    (if (= i k)
        (/ (n k) (d k))
        (/ (n i) (+ (d i) (recurse (+ i 1))))))
  (recurse 1))

(define (search-k-approx f start target error)
  (if (<
       (abs (- (f start) target))
       error)
  start
  (search-k-approx f (+ start 1) target error)))

(display (search-k-approx
          (lambda (k)
            (cont-frac
             (lambda (i) 1.0)
             (lambda (i) 1.0)
             k))
         3
         0.61803398
         0.0001))
#+end_src

#+RESULTS:
: 10

*** Iterative
#+begin_src scheme
(define (cont-frac n d k)
  (define (iter k result)
    (if (= k 0)
        result
        (iter
         (- k 1)
         (/ (n k)
            (+ (d k) result)))))
  (iter (- k 1) (/ (n k) (d k))))

(define (search-k-approx f start target error)
  (if (<
       (abs (- (f start) target))
       error)
  start
  (search-k-approx f (+ start 1) target error)))

(display
 (search-k-approx
  (lambda (k)
    (cont-frac
     (lambda (i) 1.0)
     (lambda (i) 1.0)
     k))
  3
  0.61803398
  0.0001))
#+end_src

#+RESULTS:
: 10

